In [2]:
import pandas as pd

In [3]:
# converting list into dataframe
list1 = [{'product_id':23, 'name':'computer', 'wholesale_price': 500, 'retail_price':1000, 'sales':100}, 
{'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,'retail_price':75, 'sales':1000},
{'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35, 'retail_price':75, 'sales':500},
{'product_id':15, 'name':'banana', 'wholesale_price': 0.5,'retail_price':1, 'sales':200},
{'product_id':87, 'name':'sandwich', 'wholesale_price': 3,'retail_price':5, 'sales':300}]

df = pd.DataFrame(list1)
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

### Calculate Total Profit for each product

In [4]:
df['net_revenue_per_product'] = (df['retail_price'] - df['wholesale_price']) * df['sales']
df[['name','net_revenue_per_product']]

             name  net_revenue_per_product
0        computer                  50000.0
1  Python Workout                  40000.0
2  Pandas Workout                  20000.0
3          banana                    100.0
4        sandwich                    600.0

### How much total revenue was received from all the sales

In [5]:
print("Net revenue is : ", df['net_revenue_per_product'].sum())

Net revenue is :  110700.0

### What product's retail price was more than twice the wholesale price

In [6]:
df[df['retail_price'] > (2 * df["wholesale_price"])]

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0

### How much did the store make from food vs computers vs books

In [7]:
food_sales = df[ df['name'].str.contains('banana|sandwich')]['net_revenue_per_product']
book_sales = df[ df['name'].str.contains('Python Workout|Pandas Workout')]['net_revenue_per_product']
computer_sales = df[ df['name'].str.contains('computer')]['net_revenue_per_product'] 

print("The food sales were : ", food_sales.sum())
print("The book sales were : ", book_sales.sum())
print("The computer sales were : ", computer_sales.sum())

The food sales were :  700.0
The book sales were :  60000.0
The computer sales were :  50000.0

### New net revenue

In [8]:
df['new_wholesale_price'] = df['wholesale_price'] * 0.7
df['new_wholesale_price']

df['new_net_revenue_per_product'] = (df['retail_price'] - df['new_wholesale_price']) * df['sales']
print("New net revenue is : ", df['new_net_revenue_per_product'].sum())
df

New net revenue is :  141750.0

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,new_wholesale_price,new_net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0,350.00,65000.0
1,96,Python Workout,35.0,75,1000,40000.0,24.50,50500.0
2,97,Pandas Workout,35.0,75,500,20000.0,24.50,25250.0
3,15,banana,0.5,1,200,100.0,0.35,130.0
4,87,sandwich,3.0,5,300,600.0,2.10,870.0

### 15% tax rate

In [11]:
df['15%_tax_rate'] = df['net_revenue_per_product'] * 0.85
df[['name','15%_tax_rate']]

             name  15%_tax_rate
0        computer       42500.0
1  Python Workout       34000.0
2  Pandas Workout       17000.0
3          banana          85.0
4        sandwich         510.0

### 20% tax rate

In [12]:
df['20%_tax_rate'] = df['net_revenue_per_product'] * 0.80
df[['name','20%_tax_rate']]

             name  20%_tax_rate
0        computer       40000.0
1  Python Workout       32000.0
2  Pandas Workout       16000.0
3          banana          80.0
4        sandwich         480.0

### 25% tax rate

In [13]:
df['25%_tax_rate'] = df['net_revenue_per_product'] * 0.75
df[['name','25%_tax_rate']]

             name  25%_tax_rate
0        computer       37500.0
1  Python Workout       30000.0
2  Pandas Workout       15000.0
3          banana          75.0
4        sandwich         450.0

In [14]:
df

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,new_wholesale_price,new_net_revenue_per_product,15%_tax_rate,20%_tax_rate,25%_tax_rate
0,23,computer,500.0,1000,100,50000.0,350.00,65000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,24.50,50500.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,24.50,25250.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,0.35,130.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,2.10,870.0,510.0,480.0,450.0